app/views/articles/show.html.erb

SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.`id` = `taggings`.`tag_id` WHERE `taggings`.`article_id` = 21
---
  Tags:
  <% @article.tags.each do |tag| %>

SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 14
---
<br>
<h4>Comments (<%= @article.comments.size %>)</h4>