app/controllers/articles_controller.rb

	def create
  		@article = Article.new(article_params)
  		@article.save
---
INSERT INTO `articles` (`title`, `body`, `image_file_name`, `image_content_type`, `image_file_size`, `created_at`, `updated_at`) VALUES ('If it goes down', 'Bass my heart', '12.png', 'image/png', 142086, '2016-01-29 20:53:33', '2016-01-29 20:53:33')

	def update
		@article = Article.find(params[:id])
		@article.update(article_params)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 13 LIMIT 1
UPDATE `articles` SET `image_file_name` = '1.jpeg', `image_content_type` = 'image/jpeg', `image_file_size` = 280160, `updated_at` = '2016-01-29 20:45:25' WHERE `articles`.`id` = 23