app/controllers/comments_controller.rb

	def create
		@comment = Comment.new(comment_params)
		@comment.article_id = params[:article_id]

		@comment.save
---
INSERT INTO `comments` (`author_name`, `body`, `article_id`, `created_at`, `updated_at`) VALUES ('s', 's', 14, '2016-01-29 00:46:02', '2016-01-29 00:46:02')